topics = {
    'Закони Ньютона': {
        'video_lesson': 'https://www.youtube.com/watch?v=Nomz8AgkifA',
        'law': """Ньютонові закони руху (або просто закони Ньютона) — це фундаментальні закони класичної механіки.
                Вони були вперше опубліковані Ісааком Ньютоном в праці «Математичні начала натуральної філософії» 
                (1687) та застосовані ним для пояснення багатьох фізичних явищ, пов'язаних з рухом фізичних тіл.""",
        'photo': 'newton.jpg',
        'formulas': ('1 закон = F=0, a=0\n'
                    '2 закон = F= m*a\n'
                    '3 закон = F1 = -F2')},
    'Лінзи': {
        'video_lesson': 'https://youtu.be/kR2TzM1pxNc?si=NIIkk6AVgeyS6Ef5',
        'law': """Опти́чна лі́нза — найпростіший оптичний елемент, виготовлений із прозорого матеріалу, 
        обмежений двома заломлюючими поверхнями, які мають спільну вісь, або взаємно перпендикулярні площини симетрії.
         При виготовлені лінз для видимого діапазону світла, використовують оптичне або органічне скло, 
         в УФ діапазоні — кварц, флюорит, і т. д., в ІЧ-діапазоні — спеціальні сорти скла, кремінь, сапфір, германій, ряд солей тощо.""",
        'photo': 'linzy.jpg',
        'formulas': ('формула тонкої лінзи = 1/F=(1/d)+(1/f)\n'
                     'оптична сила лінзи = D = 1/F\n'
                     'збільшення лінзи = F/F-f')},
    'Ядерна фізика': {
        'video_lesson': 'https://www.youtube.com/watch?v=r-4LyRguNoE',
        'law':"""Я́дерна фі́зика — розділ фізики, який вивчає структуру і властивості атомних ядер, та механізми ядерних реакцій.
         Задачі, що виникають в ядерній фізиці — це типовий приклад задач декількох тіл. Ядра складаються з нуклонів.
          У типових ядрах містяться десятки та сотні нуклонів""",
        'photo': 'atom.jpg',
        'formulas': ('склад ядра атома - А = Z+N(A = Np + Nn)\n'
                     'енергія зв\'язку - Езв = Am •с^2\n'
                     'закон радіоактивного розпаду - N = N0 * 2^-(t/T)')},
    'Закон Кулона': {
        'video_lesson': 'https://www.youtube.com/watch?v=YUyB3BXPtjY',
        'law': """Закон Кулона — один з основних законів електростатики,
         який визначає величину та напрямок сили взаємодії між двома нерухомими точковими зарядами. 
         Експериментально з задовільною точністю закон вперше встановив Генрі Кавендіш у 1773.
          Він використовував метод сферичного конденсатора, але не опублікував своїх результатів.
           У 1785 році закон був встановлений Шарлем Кулоном за допомогою спеціальних крутильних терезів.""",
        'photo': 'kykold.jpg',
        'formulas': '(F = k*|q1|*|q2|)/r^2'}
}
